rails_project/app/controllers/admin/roles_controller.rb

SELECT "roles".* FROM "roles" WHERE "roles"."parent_id" IS NULL
---
  def index
    @roles = Role.where :parent_id => nil

SELECT "roles".* FROM "roles"
---
  def new
    @role = Role.new
    @roles = Role.all

SELECT "roles".* FROM "roles" WHERE "roles"."id" = ? LIMIT 1  [["id", "8"]]
SELECT "roles".* FROM "roles"
---
  def edit
    @role = Role.find(params[:id])
    @roles = Role.all

INSERT INTO "roles" ("created_at", "name", "parent_id", "resource_id", "resource_type", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Fri, 09 Mar 2012 11:27:02 UTC +00:00], ["name", "moderator"], ["parent_id", 8], ["resource_id", nil], ["resource_type", nil], ["updated_at", Fri, 09 Mar 2012 11:27:02 UTC +00:00]]
---
  def create
    @role = Role.new(params[:role])

    respond_to do |format|
      if @role.save

SELECT "roles".* FROM "roles" WHERE "roles"."id" = ? LIMIT 1  [["id", "10"]]
DELETE FROM "roles" WHERE "roles"."id" = ?  [["id", 10]]
---
  def destroy
    @role = Role.find_by_id(params[:id])
    unless @role.nil?
      @role.destroy