rails_project/app/controllers/admin/users_controller.rb

SELECT "roles".* FROM "roles"
---
  def new
    @user = User.new
    @roles = Role.all

SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
SELECT "roles".* FROM "roles"
---
  def edit
    @user = User.find(params[:id])
    @roles = Role.all

INSERT INTO "users" ("created_at", "current_sign_in_at", "current_sign_in_ip", "email", "encrypted_password", "last_sign_in_at", "last_sign_in_ip", "remember_created_at", "reset_password_sent_at", "reset_password_token", "sign_in_count", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
SELECT "roles".* FROM "roles"
---
  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save
        format.html { redirect_to admin_users_path, notice: 'User was successfully created.' }
        format.json { render json: @user, status: :created, location: @user }
      else
        @roles = Role.all

SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 3]]
---
  def destroy
    @user = User.find_by_id(params[:id])
    unless @user.nil?
      @user.destroy